package org.example._2024_05_28;

public class Unary {
    public static void main(String[] args) {
//Создайте класс Unary
//Создайте переменную с положительным знаком
//Измените знак на отрицательный используя унарный минус
//Результат распечатайте в консоле

        int chislo = 8;
        System.out.println("Chislo s otrizatelnym znakom: " + (-chislo));

    }
}
