package org.example._2024_05_29;

import org.w3c.dom.ls.LSOutput;

public class Task {
    public static void main(String[] args) {
        //Создайте и инициализируйте переменную int = 10
        //В блоке if сравните созданную переменную со значением 15
        //После блока добавьте инструкцию System.out.println("I am Not in if");
        //Проанализируйте вывод

//        int num1 = 10;
//        int num2 = 15;

//        if (num2 == num1){
//            System.out.println("I am in if");
//        }
//        System.out.println("I am Not in if");

//==================================
//        Создайте и инициализируйте переменную int = 10
//        В блоке if сравните созданную переменную со значением 15
//        Внутри блока добавьте инструкцию System.out.println("i is smaller than 15");
//        В  блоке else добавьте инструкцию System.out.println("i is greater than 15");
//        Проанализируйте вывод

//        if (num1 < num2) {
//            System.out.println("It is smaller than 15");
//        }else{
//            System.out.println("It is greater than 15");
//        }

//================================

//Создайте и инициализируйте переменную int = 10
//В блоке if сравните созданную переменную со значением 10 (!=)
//Внутри блока добавьте блок if и сравните переменную со значением 15 ,
// внутри блока добавить инструкцию System.out.println("i is smaller than 15");
//Добавите еще один блок if-else и сравните переменную со значением 12 
//В блоке if добавить инструкцию System.out.println("i is smaller than 12 too")
//В  блоке else добавьте инструкцию System.out.println("i is greater than 12");
//Проанализируйте вывод
//        int i = 20;
//        if (i != 10) {
//            System.out.println("ууууууууууу..... нифига не понятно");
//
//                if (i < 12){
//                    System.out.println("it is smaller than 12");
//                } else if (i < 15) {
//                    System.out.println("it is smaller than 15 too");
//                }else{
//                    System.out.println("it is greater than 15");
//                }
//        }else {
//            System.out.println("Не угадал, опять фигня получилась...");
//
//        }

    //====================================================

        //Создайте и инициализируйте переменную int i = 20
        //В блоке if сравните созданную переменную со значением 10 (==)
        //В блоке if добавить инструкцию System.out.println("i is 10")
        //Добавьте блок else if и сравните переменную со значением 15 (==) ,
        // внутри блока добавить инструкцию System.out.println("i is 15");
        //Добавите еще один блок else if и сравните переменную со значением 20 (==) 
        //Добавьте блок else добавьте инструкцию System.out.println("i is not present");
        //Проанализируйте вывод
//        int i = 20;
//            if (i == 10) {
//                System.out.println("i is 10");
//            } else if (i == 15) {
//                System.out.println("i is 15");
//            } else if (i == 20) {
//                System.out.println("i is not present????? ПОЧЕМУ? очень даже презент");
//            }else {
//                System.out.println("Нифига не выводим");
//            }


//==========================================

        //Создайте и инициализируйте переменную boolean t = true;
        //Добавьте инструкцию System.out.println("Before the return instruction");
        //В блоке if определите оператор return
        //Добавьте инструкцию после блока if System.out.println("This won't execute");
        //Запустите код

       boolean t = true;
       System.out.println("Before the return instruction");
        if (t) {
            return;
        }
            System.out.println("This won't execute");








    }
}
