//package org.example._2024_05_27;

import java.util.Scanner;

//Напишите класс Converter для конвертации из градусов по Цельсию в Кельвины​, ​Фаренгейты:
//У класса должны быть методы для конвертации.
//Реализуйте два метода в классе:
//runKelvinConverter(double baseValue)
//runFahrenheitConverter(double baseValue)кельвины и фаренгейты


//public class Converter {
//    public static void main(String[] args) {
//        Scanner scanner = new Scanner(System.in);
//
//        System.out.print("Таки вводите уже вашу температуру по Цельсию: ");
//        double celsius = scanner.nextDouble();
//
//        double fahrenheit = runFahrenheitConverter(celsius);
//        double kelvin = runKelvinConverter(celsius);
//
//        System.out.println("Получено по Фаренгейту: " + fahrenheit + "  Но это не точно....");
//        System.out.println("Получено по Кельвину: " + kelvin + "  Но это тоже не точно....");
//    }
//    public static double runFahrenheitConverter(double celsius) {
//        return (celsius * 1.8) + 32;
//    }
//    public static double runKelvinConverter(double celsius) {
//        return celsius + 273.15;
//    }




//    Напишите программу на Java для того, чтобы поменять местами значения,
//    хранящиеся в двух переменных с помощью третьей переменной:
//
//    На вход: а = 2; b = 5;
//    На выход: a = 5; b = 2;
//    Используйте переменную temp;


//
//
//
//}
//
//}