package org.example._2024_05_27;
//Напишите метод, который принимает на вход количество студентов и “рандомально” выбирает
// любого студента начиная со второго включительно.
//Например: в зуум сейчас присутствуют 10 участников.
// Первый участник - это преподаватель.
// Выбор должен быть сделан из 9 последующих, т.е.
// число выбирается из диапазона 2-10.
//public class Randoms {
//    public static void main(String[] args) {
//        int min = 2;
//        int max = 10;
////        System.out.println((int) (Math.random()*(max-min+1)+min));
////        chooseStudent(min, max);
//        System.out.println(chooseStudent(min, max));
//    }
//
//    public static int chooseStudent (int min, int max){
//        int randomStudent = (int)(Math.random()*(max-min+1)+min);
//        return randomStudent;
//    }
//}
